import 'package:bsnu/components/constantcontainers/1table.dart';
import 'package:bsnu/components/constantcontainers/1table1.dart';
import 'package:bsnu/components/constantcontainers/abbbars1.dart';
import 'package:bsnu/components/constantcontainers/rowofeverynum.dart';
import 'package:bsnu/components/constantcontainers/textofeverypage.dart';
import 'package:bsnu/components/constantcontainers/containerhaslist.dart';
import 'package:flutter/material.dart';

class rules1 extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
        appBar: AppBar(
          surfaceTintColor: Color(0xffffffff),
          foregroundColor: Color(0xffffffff),
          backgroundColor: Color(0xffffffff),
          title: appbars1(
            text: "كلية العلاج الطبيعي",
          ),
          automaticallyImplyLeading: false,
        ),
        body: Container(
          color: Colors.white,
          child: Column(
            children: [
              textofeverypage(
                  text: "السجل الأكاديمي للطالب و الإرشاد الأكاديمي"),
              Expanded(
                child: ListView(
                  children: [
                    SizedBox(
                      height: 10,
                    ),
                    CustomContainer(
                      text1: "",
                      text: "السجل الأكاديمي للطالب ",
                      listViewChildren: [
                        Text(
                          "بيان يوضح سير الطالب الدراسي منذ بدء التحاقه بالدراسة، ويشمل المقررات التي يدرسها الطالب في كل فصل دراسي، بأسمائها وأكودها وعدد ساعاتها المعتمدة والتقديرات التي حصل عليها الطالب في هذه المرات، كما يوضح السجل الأكاديمي المعدل الفصلي والمعدل التراكمي، ويبين التقدير العام للطالب، وبالنسبة للطالب المحول من كلية أخري يبين هذا السجل المقررات المعادلة التي درسها الطالب في الكلية المناظرة والمقررات التي أعفي الطالب من دراستها في برنامج الكلية الدراسي بعد إجراء المقاصة المطلوبة.",
                          style: TextStyle(
                              fontSize: 16,
                              color: Colors.black,
                              fontWeight: FontWeight.w500,
                              fontFamily: "Cairo"),
                        ),
                      ],
                    ),
                    CustomContainer(
                        text: "الإرشاد الأكاديمي",
                        text1: "",
                        listViewChildren: [
                          Text(
                            "تقترح لجنة إشراف البرنامج لكل طالب مرشدًا أكاديميًا من أعضاء هيئة التدريس بالكلية ويتم اعتماد ذلك في مجلس الكلية، وذلك لتقديم النصح والإرشاد خلال فترة دراسته ولمساعدته في اختيار المقررات الدراسية الأساسية والاختيارية اللازمة لمجال تخصصه",
                            style: TextStyle(
                                fontSize: 16,
                                color: Colors.black,
                                fontWeight: FontWeight.w500,
                                fontFamily: "Cairo"),
                          )
                        ]),
                    CustomContainer(
                        text: "الدرجات العلمية التي يمنحها البرنامج",
                        text1: "",
                        listViewChildren: [
                          Text(
                            "تمنح جامعة بني سويف الأهلية بناء على توصية مجلس كلية العلاج الطبيعي درجة بكالوريوس العلاج الطبيعي.",
                            style: TextStyle(
                                fontSize: 16,
                                color: Colors.black,
                                fontWeight: FontWeight.w500,
                                fontFamily: "Cairo"),
                          )
                        ]),
                    CustomContainer(
                        text: "لغة الدراسة",
                        text1: "",
                        listViewChildren: [
                          Text(
                            "اللغة الانجليزية هي لغة التدريس الأساسية، ويجوز تدريس بعض المقررات باللغة العربية، بناءً على توصية القسم العلمي المختص وموافقة مجلسي البرنامج والكلية، ويجوز تدريس مقررات الجامعة باللغة العربية.",
                            style: TextStyle(
                                fontSize: 16,
                                color: Colors.black,
                                fontWeight: FontWeight.w500,
                                fontFamily: "Cairo"),
                          )
                        ]),
                    CustomContainer(
                        text: "شروط القبول والقيد والتحويل",
                        text1: "",
                        listViewChildren: [
                          rowofeverynumber(
                              image: "images/round.png",
                              text:
                                  "يقبل البرنامج الطلاب الحاصلين على الثانوية العامة (القسم/العلمي شعبة / العلمي علوم)أو ما يعادلها طبقا للقواعد التي يحددها المجلس الأعلى للجامعات."),
                          rowofeverynumber(
                              image: "images/number-2.png",
                              text:
                                  "يجوز قبول طلاب من الحاصلين على درجة البكالوريوس بتقدير عام جيد على الأقل من تخصصات الطب والجراحة والصيدلة وطب الفم والأسنان من جامعات معتمدة من المجلس الأعلى للجامعات للدراسة بالبرنامج، وذلك طبقا للنظام الذي يقره مجلس الجامعة وذلك بعد أخذ رأى الأقسام المختصة، وبعد عمل مقاصة للمقارنة بين المقررات التي درسها الطالب وما يجب أن يدرسه بالبرنامج."),
                          rowofeverynumber(
                              image: "images/number-3.png",
                              text:
                                  "يجوز لمجلس الكلية قبول طلاب محولين من برا مج أخرى بالجامعة أو من جامعات أخرى بشرط ألا يقل المعدل التراكمي عن 2.00 من أربع نقاط للمعدل التراكمي للطالب المُحول بعد إجراء مقاصة للمقررات التي درسها الطالب بكليته الأصلية؛ بحيث لا يزيد إجمالي الساعات المعتمدة التي درسها الطالب ولها مناظر بالكلية عن 40 % من إجمالي عدد الساعات المعتمدة المطلوبة للتخرج بالبرنامج مع إعفاء الطالب من المقررات المناظرة بعد اعتماد المقاصة من لجنة إشراف البرنامج."),
                          rowofeverynumber(
                            image: "images/number-four.png",
                            text: "اجتياز الكشف الطبي. ",
                          ),
                          rowofeverynumber(
                              image: "images/number-5.png",
                              text:
                                  "يجوز طلب استيفاء أي شروط أخرى يحددها مجلس الكلية ويعتمدها مجلس الجامعة وتعلن وقت التقديم، مثل إجراء المقابلة الشخصية وتحديد حد أدني لدرجات بعض المقررات في الثانوية العامة."),
                        ]),
                    CustomContainer(
                        text: "نظام ومدة الدراسة",
                        text1: "",
                        listViewChildren: [
                          rowofeverynumber(
                              image: "images/round.png",
                              text:
                                  "تسير الدراسة في البرنامج بنظام الساعات المعتمدة، وتم توزيع المقررات الدراسية بالبرنامج الدراسي على خمس مستويات دراسية (وعشرة فصول دراسية)، ويحدد لكل مقرر وزن معين بالنسبة إلى المقررات الأخرى بالبرنامج الدراسي، وتكون(2.00)(CGPA)وحدة قياس وزن المقرر بالساعة المعتمدة، ولكي يتخرج الطالب عليه أن يحقق معدل تراكمي متوسط كحد أدني للتخرج."),
                          rowofeverynumber(
                              image: "images/number-2.png",
                              text:
                                  """تنقسم السنة الأكاديمية إلى فصلين دراسيين طبقًا للمواعيد التي يحددها المجلس الأعلى للجامعات، على النحو التالي :
- الفصل الدراسي الأول: يبدأ عادة في شهر سبتمبر ولمدة 17 أسبوع شاملًا الامتحانات .
- الفصل الدراسي الثاني: يبدأ عادة في شهر فبراير ولمدة 17 أسبوع شاملًا الامتحانات .
- يجوز عقد فصل دراسي صيفي بعد موافقة لجنة إشراف البرنامج ومجلس الكلية ويبدأ عادة في شهر يوليو ولمدة من
ستة إلي ثمانية أسابيع من الدراسة المكثفة عل ى ألا يقل مجموع ساعات الدراسة لكل ساعة معتمدة عن خمسة عشرة
ساعة في الفصل الدراسي الواحد
 """),
                          rowofeverynumber(
                              image: "images/number-3.png",
                              text:
                                  "تمنح الدرجة العلمية متى استوفي الطالب متطلبات الحصول عليها وفقا لما تحدده اللائحة."),
                          rowofeverynumber(
                              image: "images/number-four.png",
                              text:
                                  "ويجوز لمجلس الكلية بعد أخذ رأى مجلس القسم المختص وحسب طبيعة المقررات الدراسية أن يقرر تدريس مقرر أو أكثر 40 % بنظام التعليم عن بعد أو بأي نسبة - 70 % وجها لوجه وبنسبة 30 - بنمط التعليم الهجين بحيث تكون الدراسة بنسبة 60 أخرى وعلى أن يتم عرض ذلك على مجلس الجامعة للموافقة عليه واعتماده.")
                        ]),
                    CustomContainer(
                        text: "العبء الدراسي",
                        text1: "",
                        listViewChildren: [
                          rowofeverynumber(
                              image: "images/round.png",
                              text:
                                  "العبء الدراسي هو عدد الساعات المعتمدة التي يقوم الطالب بتسجيلها في الفصل الدراسي الواحد"),
                          rowofeverynumber(
                              image: "images/number-2.png",
                              text:
                                  "الحد الأدنى للتسجيل في المقررات في الفصل الدراسي هو 12 ساعة معتمدة للفصل الدراسي الواحد، إلا في حالات التخرج حيث يتم تحديد الساعات المتبقية للتخرج بمعرفة لجنة إشراف البرنامج بغرض إتمام متطلبات التخرج، ويجوز إنقاص الحد الأدنى في حالة حصول الطالب على معدل تراكمي أقل من 2.00 وفى حالات أخري استثنائية توافق عليها لجنة إشراف البرنامج ويعتمدها مجلس الجامعة."),
                          rowofeverynumber(
                              image: "images/number-3.png",
                              text:
                                  "الحد الأقصى للتسجيل في المقررات في الفصل الدراسي يكون طبقا لعدد الساعات المعتمدة للفصل الدراسي الواحد بالخطة الدراسية ."),
                          rowofeverynumber(
                              image: "images/number-four.png",
                              text:
                                  "يجوز للجنة إشراف البرنامج السماح للطالب في أخر فصلين دراسيين له بزيادة العبء الدراسي عن الحد الأقصى وبما لا يتجاوز عدد 4 ساعات معتمدة في الفصل الدراسي الواحد، وذلك بغرض التخرج."),
                          rowofeverynumber(
                              image: "images/number-5.png",
                              text:
                                  "بالنسبة للفصل الصيفي يكون الحد الأقصى لعدد الساعات التي يسمح للطالب بتسجيلها 9ساعات معتمدة، فيما عدا حالات التخرج فيتم تحديد الساعات بناء على اقتراح لجنة إشراف البرنامج وموافقة مجلس الجامعة بحد أقصى 2ساعة معتمدة إضافية، كما يجوز للجنة إشراف البرنامج السماح للطالب المتعثر بزيادة العبء الدراسي عن الحد الأقصى خلال الفصل الصيفي فقط وبما لا يتجاوز عدد 2 ساعة معتمدة إضافي"),
                          rowofeverynumber(
                              image: "images/six.png",
                              text:
                                  "لا يسمح للطالب الذي يقل معدله التراكمي عن (2.00) بالتسجيل في أكثر من 14 ساعة معتمدة في الفصل الدراسي ويوجه له إنذار أول، وإذا استمر معدل الطالب أقل من (2) يوجه له إنذار ثانٍ ويسجل عدداً من الساعات لا يزيد عن 12 ساعة في الفصل الدراسي.")
                        ]),
                    CustomContainer(
                        text: "التعثر الأكاديمي وتأجيل الدراسة",
                        text1: "",
                        listViewChildren: [
                          rowofeverynumber(
                              image: "images/round.png",
                              text:
                                  "يعتبر الطالب متعثر أكاديميا إذا حصل على معدل فصلي (GPA) أقل من (2)"),
                          rowofeverynumber(
                              image: "images/number-2.png",
                              text:
                                  "الطالب الذي يحصل على معدل فصلي (GPA) أقل من (2) لعدد نصف الفصول الدراسية األساسية للبرنامج 5 فصول دراسية، متصلة أو غير متصلة، يفصل من الكلية وال يؤخذ في االعتبار الفصول الصيفية إن وجدت."),
                          rowofeverynumber(
                              image: "images/number-3.png",
                              text:
                                  "يحق للطالب التقدم بطلب تأجيل الدراسة لعذر تقبله لجنة إشراف البرنامج على ألا يتجاوز عدد مرات التأجيل قرارات مجلس   الجامعة المنظمة لهذا الشأن ويرصد تقدير (DEL-C) أي مؤجل فرصة، ولا تحتسب مدة التأجيل ضمن المدة الازمة لإنهاء متطلبات التخرج الواردة في المادة (17) من الالئحة. يشترط فيمن يؤجل دراسته أن يكون قد أمضى فصالً دراسياً واحداً على الأقل في البرنامج. وعندما تتم الموافقة على تأجيل الدارسة يلغي التسجيل في ذلك الفصل الدراسي ويقيد تاريخ التأجيل في سجل الطالب."),
                          rowofeverynumber(
                              image: "images/number-four.png",
                              text:
                                  "إذا لم يتقدم الطالب بطلب إلعادة قيده بعد فترة التأجيل الممنوحة له فيلغي قيده بالكلية ويجوز النظر في إعادة قيده بالكلية لمرة واحدة فقط في الظروف الاستثنائية على أن يلتحق الطالب مع بداية عام دراسي بموافقة مجلس الكلية.")
                        ]),
                    CustomContainer(
                        text: "الإضافة والحذف واالنسحاب من المقرر",
                        text1: "",
                        listViewChildren: [
                          rowofeverynumber(
                              image: "images/round.png",
                              text:
                                  "يجوز للطالب بعد موافقة المرشد الأكاديمي أن يضيف أو يحذف مقرراً أو أكثر حتى نهاية الأسبوع الثاني من بدء الفصل الدراسي االعتيادي أو نهاية الأسبوع الأول من الفصل الصيفي، بعد استيفاء الحذف أو الإضافة في استمارة تسجيل المقررات وموقعة من المرشد الأكاديمي دون أن يظهر المقرر الذي تم حذفه في سجله الدراسي، بما لا يخل بالعبء الدراسي"),
                          rowofeverynumber(
                              image: "images/number-2.png",
                              text:
                                  "يمكن للطالب بعد أخذ رأي المرشد الأكاديمي الأنسحاب من مقرر دراسي أو أكثر لأسباب اضطرارية حتى نهاية فترة الإنسحاب المنصوص عليها في الأجندة الدراسية والتي تنتهي قبل بدء الامتحانات النظرية بأسبوعين على الأقل، ولا تحتسب ساعات هذا المقرر المعتمدة في متوسط نقاط الدرجات  GPAويرمز للدرجة في النتيجة بحرف(W)، بشرط عدم الأخالل بالعبء الدراسي.يتم الأنسحاب في هذه الحالة وفق نموذج خاص تعده إدارة البرنامج، ويتضمن هذا النموذج موافقة المرشد الأكاديمي وموافقة لجنة إشراف البرنامج."),
                        ]),
                    CustomContainer(
                        text: "قواعد التقييم",
                        text1: "",
                        listViewChildren: [
                          rowofeverynumber(
                              image: "images/round.png",
                              text:
                                  "يُعد الطالب راسبًا في المقرر إذا حصل على أقل من 30 % من درجة الامتحان النظري النهائي لهذا المقرر مهما كانت درجاته ويجب عليه ،(F) في الأعمال الفصلية، أو إذا حصل على أقل من 60 % من مجموع درجات المقرر – ويرصد له في معدله إعادة دراسة المقرر بكافة أجزائه إذا كان اجباريًا ويحق للطالب دراسة مقرر بديل إذا كان اختياريًا."),
                          rowofeverynumber(
                              image: "images/number-2.png",
                              text:
                                  "يحصل الطالب علي تقدير (I) غير مكتمل إذا تعذر عليه دخول االمتحان النهائي للمقرر أو إتمام بعض متطلباته ألسباب قهرية تقبلها لجنة إشراف البرنامج (بشرط أن يكون الطالب قد حضر %75 على األقل من محاضرات المقرر) ويقوم بدخول االمتحان النظري فقط في أول فصل دراسي يتم فيه فتح المقرر الدراسي ويحصل على تقديره كامالً."),
                          rowofeverynumber(
                              image: "images/number-3.png",
                              text:
                                  "فى حالة رسوب الطالب سواء بعدم استيفاء درجات النجاح أو التغيب بدون عذر أو الحرمان من دخول االمتحان النهائي فإن الطالب يحصل على تقدير راسب (F)، مع احتساب تقدير المقرر في حالة نجاح الطالب بما ال يزيد عن الحد األقصى للمقبول أي بما ال يتجاوز تقدير المقرر .D"),
                          rowofeverynumber(
                              image: "images/number-four.png",
                              text:
                                  "ال ينتقل الطالب من مستوي إلى مستوي آخر إذا تبقي لديه في المستوي األقل عدد 3 مقررات فأكثر لم يتم اجتيازها."),
                        ]),
                    CustomContainer(
                        text: "حساب معدلات الطالب",
                        listViewChildren: [
                          Text(
                            "يوضح الجدول التالي متوسط نقاط الدرجات والنسب المئوية والتقديرات المكافئة لهاألي مقرر دراسي:",
                            style: TextStyle(
                                fontSize: 16,
                                color: Colors.black,
                                fontWeight: FontWeight.w500,
                                fontFamily: "Cairo"),
                          ),
                          table111(
                              text: "حدود الدرجة",
                              text1: "النقط من 4",
                              text2: "رمز التقدير",
                              text3: "التقدير (Grade)"),
                          mtable111(
                              text: "من 95 إلى 100",
                              text1: "4.0",
                              text2: "A+ (أ+)",
                              text3: "Excellent (ممتاز)"),
                          mtable111(
                              text: "من 90 إلى أقل من 95",
                              text1: "3.85",
                              text2: "A (أ)",
                              text3: "Excellent (ممتاز)"),
                          mtable111(
                              text: "من 85 إلى أقل من 90",
                              text1: "3.7",
                              text2: "A- (أ-)",
                              text3: "Excellent (ممتاز)"),
                          mtable111(
                              text: "من 80 إلى أقل من 85",
                              text1: "3.3",
                              text2: "B+ (ب+)",
                              text3: "Very Good (جيد جدا)"),
                          mtable111(
                              text: "من 75 إلى أقل من 80",
                              text1: "3.0",
                              text2: "B (ب)",
                              text3: "Very Good (جيد جدا)"),
                          mtable111(
                              text: "من 70 إلى أقل من 75",
                              text1: "2.7",
                              text2: "C+ (ج+)",
                              text3: "Good (جيد)"),
                          mtable111(
                              text: "من 65 إلى أقل من 70",
                              text1: "2.3",
                              text2: "C (ج)",
                              text3: "Good (جيد)"),
                          mtable111(
                              text: "من 60 إلى أقل من 65",
                              text1: "2.0",
                              text2: "D (ل)",
                              text3: "Fair (مقبول)"),
                          mtable111(
                              text: "أقل من 60",
                              text1: "0.0",
                              text2: "F (ر)",
                              text3: "Fail (راسب)"),
                          mtable111(
                              text: "أكبر من 60",
                              text1: "-----",
                              text2: "P (ن)",
                              text3: "Pass (ناجح بدون درجة)"),
                          mtable111(
                              text: "----------",
                              text1: "-----",
                              text2: "I (غ م)",
                              text3: "Incomplete (غير مكتمل)"),
                          mtable111(
                              text: "أقل من 60",
                              text1: "0.0",
                              text2: "DN (م ح)",
                              text3: "Denial (محروم)"),
                          mtable111(
                              text: "----------",
                              text1: "-----",
                              text2: "W (م ن)",
                              text3: "Withdrawn (منسحب)"),
                          mtable111(
                              text: "-",
                              text1: "-----",
                              text2: "DEL-C (م ف)",
                              text3: "Delayed-Chance (مؤجل عذر)"),
                          Image.asset("images/GPA.png"),
                          rowofeverynumber(
                              image: "images/round.png",
                              text:
                                  "المعدل الفصلي (GPA : Grade Point Average) لكل مستوى دراسي يساوي مجموع نقاط تقدير جميع المقررات مقسوما على مجموع الساعات المعتمدة لكل المقررات الدراسية التي أكملها الطالب في المستوى الدراسي . نقاط تقدير المقرر تساوي عدد الساعات المعتمدة للمقرر مضروبا في نقاط المقرر"),
                          Image.asset("images/CGPA.png"),
                          rowofeverynumber(
                              image: "images/number-2.png",
                              text:
                                  "المعدل التراكمي العام CGPA هو متوسط ما يحصل عليه الطالب من نقاط خلال الفصول الدراسية و يقرب إلى رقمسن عشريين فقط ."),
                        ],
                        text1: "")
                  ],
                ),
              ),
            ],
          ),
        ));
  }
}
